---
kind: type
id: T:Autodesk.Revit.DB.CopyPasteOptions
source: html/d8f58fd5-2106-7a88-6218-106a30415791.htm
---
# Autodesk.Revit.DB.CopyPasteOptions

Settings to control the behavior of a copy-paste operation.

## Syntax (C#)
```csharp
public class CopyPasteOptions : IDisposable
```